//模拟数据库
var messages = [
{"id":6,"country":"cn","title":"流浪地球","source":"https://www.1905.com/mdb/film/2228651/","time":"2019-02-05","pic":"The-Wandering-Earth.jpg",
	"content":"本片讲述了在不久后的未来，太阳即将毁灭，依靠太阳为生的地球也即将面临灭亡。面对绝境，人类拒绝坐以待毙，在地球表面建造出了巨大的推进器，将地球推出太阳系、为人类寻找新的家园，这一宏大的计划被称为流浪地球计划。"},

{"id":6,"country":"us","title":"火星救援","source":"https://www.1905.com/mdb/film/2226851/","time":"2015-10-02","pic":"The-Martian.jpg",
	"content":"人类实现了首次在火星的登陆，而宇航员马克·沃特尼（Mark Watney）就是这个第一个登上火星的幸运儿，然而不幸的是，他也很可能将成为第一个死在这里的地球人。"},

{"id":5,"country":"us","title":"星际穿越","source":"https://www.1905.com/mdb/film/2119928/","time":"2014-10-26","pic":"Interstellar.jpg",
	"content":"美英联合制作的科幻电影。该片由克里斯托弗·诺兰执导，马修·麦康纳、安妮·海瑟薇领衔主演。该片在物理学家基普·索恩的黑洞理论之上进行改编，主要讲述了一组宇航员通过穿越虫洞来为人类寻找新家园的冒险故事。"},
{"id":4,"country":"us","title":"饥饿游戏","source":"https://www.1905.com/mdb/film/2207251/","time":"2012-03-21","pic":"The-Hunger-Games.jpg",
	"content":"曾经的北美洲，在经历了一场大灾难的洗礼之后，已经彻底地沦为一片废墟……在这片土地上，重新建立了一个名为“施惠国”的国度，而且作为这里一手遮天的权力机构——国会每一年都会以娱乐之名，强迫分属在下面的12个倍受奴役的行政区域送一对少男少女来参加“饥饿游戏”的比赛"},
　
{"id":3,"country":"us","title":"盗梦空间","source":"https://www.1905.com/mdb/film/306547/","time":"2010-07-13","pic":"Inception.jpg",
	"content":"影片讲述由莱昂纳多·迪卡普里奥扮演的造梦师，带领约瑟夫·高登-莱维特、艾伦·佩吉扮演的特工团队，进入他人梦境，从他人的潜意识中盗取机密，并重塑他人梦境的故事。"},
{"id":2,"country":"us","title":"阿凡达","source":"https://www.1905.com/mdb/film/91010/","time":"2009-12-18","pic":"Avatar.jpg",
	"content":"故事发生在2154年，故事从地球开始，杰克·萨利是一个双腿瘫痪的前海军陆战队员，他觉得没有任何东西值得他去战斗，因此他对被派遣去潘多拉星球的采矿公司工作欣然接受。"},

{"id":1,"country":"us","title":"第九区","source":"https://www.1905.com/mdb/film/91159/","time":"2009-08-14","pic":"District9.jpg",
	"content":"差不多在30年前，外星生物终于与地球有了第一次亲密接触，原来这些外星生物因为自己所在的星球遭受了战火的摧残，已成为最后一批幸存者，他们来到地球并不是为了侵略和联姻，而是要寻求庇护。在全世界的重要国家首脑会晤之后，决定在南非的第九区为这些外星生物建立一个临时避难所。 "}

];