//模拟数据库，获取信息
var messages = [
{"id":5,"country":"us","title":"飞行最远的探测器","source":"javascript:;","time":"1977-09-05",
	"content":"旅行者1号(Voyager 1)是一艘无人外太阳系太空探测器，重815千克，于1977年9月5日发射。它曾到访过木星及土星，第一次提供了它们卫星的高解析度清晰照片。它是离地球最远和飞行速度最快的人造飞行器，真正意义上飞出了太阳系，首次进入星系空间。旅行者1号与其姊妹船旅行者2号携带的钚电池(核动力电池)将持续到2025年。当电池耗尽之后，他们会停止工作，将继续向着银河系的中心前进。"},
{"id":4,"country":"ru","title":"第一座空间站","source":"javascript:void(0)","time":"1971-04-19",
	"content":"1971年4月19日，苏联发射了世界上第一座空间站“礼炮”1号，开辟了载人航天的新领域。“礼炮”1号重18425公斤，运行到1971年10月11日。运行时间最长的空间站1986年2月20日，苏联成功地发射了“和平”号空间站的核心舱，从此开始了新型空间站的建设。在“和平”号空间站运行的15年期间，共有31艘载人飞船、62艘货运飞船与其对接，28个长期考察组和16个短期考察组先后访问过“和平”号空间站，共进行了16500次科学试验，完成了23项国际科学考察计划。"},
{"id":3,"country":"us","title":"人类首次登月","source":"javascript:void(0)","time":"1969-07-20",
	"content":"1969年7月16日9点32分,装载着阿姆斯特朗、奥尔德林、和柯林斯三位宇航员的阿波罗11号,在土星5号火箭的承载下成功在肯尼迪航天中心发射升空,两名宇航员的准确登陆时间是1969年7月20日下午4时17分43秒(休斯顿时间)。"},
{"id":2,"country":"ru","title":"第一位进入太空的人","source":"javascript:void(0)","time":"1961-04-12",
	"content":"加加林于1961年4月12日在俄罗斯的沃斯托克1号航天器中爆炸进入了327公里高地球轨道,围绕了地球一周,用时89.1分钟,整个任务持续了108分钟。"},
{"id":1,"country":"ru","title":"世界上第一个人造地球卫星","source":"javascript:void(0)","time":"1957-10-04",
	"content":"1957年10月4日，世界上第一个人造地球卫星已经制成由苏联发射成功。运送卫星的火箭使卫星获得了每秒八千公尺左右的必要的轨道速度。据计算，这个卫星在离地面900公里的高空运行；它每转一整周的时间是1小时35分钟，它的运行轨道和赤道平面之间所形成的倾斜角是65度。"}                        
];